app/views/favorites/_favorite-btn.html.erb

SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", "1"]]
SELECT COUNT(*) FROM "favorites" WHERE "favorites"."book_id" = ?  [["book_id", "2"]]
---
<% if book.favorited_by?(current_user) %>
  ★<%= link_to book.favorites.count, book_favorites_path(book), method: :delete, remote: true %>
<% else %>
  ☆<%= link_to book.favorites.count, book_favorites_path(book), method: :post, remote: true %>