app/views/book_comments/_book_comment_index.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 6]]
---
        <% book_show.book_comments.each do |book_comment| %>