app/views/book_comments/_user_book_comments.html.erb

SELECT "books".* FROM "books" INNER JOIN "book_comments" ON "books"."id" = "book_comments"."book_id" WHERE "book_comments"."user_id" = ?  [["user_id", 1]]
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 8]]
---
          <div class="favorite-btn d-inline p-2"><%= render "favorites/favorite-btn", book: book %></div>
          <div class="p-2 d-inline"> □<%= link_to book.book_comments.count, book_path(book) %></div>