app/views/books/_index.html.erb

          <div class="favorite-btn d-inline p-2"><%= render "favorites/favorite-btn", book: book %></div>
          <div class="p-2 d-inline"> □<%= link_to book.book_comments.count, book_path(book) %></div>
---
SELECT "books".* FROM "books"
SELECT COUNT(*) FROM "book_comments" WHERE "book_comments"."book_id" = ?  [["book_id", 1]]