app/views/books/show.html.erb

SELECT "book_comments".* FROM "book_comments" WHERE "book_comments"."book_id" = ? AND "book_comments"."book_id" IS NULL  [["book_id", 6]]
---
      <div class="book_comments_index">
        <% @book_show.book_comments.each do |book_comment| %>