app/controllers/books_controller.rb

  def show
    @book_show = Book.find(params[:id])
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def create
    @book = Book.new(book_params)
    @book.user_id = current_user.id
    if @book.save
      flash[:notice] = "You have created book successfully."
      redirect_to book_path(@book)
    else
      @books = Book.all
---
INSERT INTO "books" ("title", "body", "user_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["title", "1111巻lk"], ["body", "おもしろい！！"], ["user_id", 3], ["created_at", "2021-01-09 13:46:20.780743"], ["updated_at", "2021-01-09 13:46:20.780743"]]
SELECT "books".* FROM "books"

  def destroy
    book = Book.find(params[:id])
    book.delete
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
DELETE FROM "books" WHERE "books"."id" = ?  [["id", 7]]