app/controllers/favorites_controller.rb

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 6], ["LIMIT", 1]]
INSERT INTO "favorites" ("created_at", "updated_at", "user_id", "book_id") VALUES (?, ?, ?, ?)  [["created_at", "2021-01-08 09:32:12.698911"], ["updated_at", "2021-01-08 09:32:12.698911"], ["user_id", "2"], ["book_id", "6"]]
---
  def create
    @book = Book.find(params[:book_id])
    favorite = @book.favorites.new(user_id: current_user.id)
    favorite.save

SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 5], ["LIMIT", 1]]
SELECT  "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ? AND "favorites"."book_id" = ? LIMIT ?  [["user_id", "2"], ["book_id", "6"], ["LIMIT", 1]]
DELETE FROM "favorites" WHERE "favorites"."id" = ?  [["id", 19]]
---
  def destroy
   @book = Book.find(params[:book_id])
   favorite = @book.favorites.find_by(user_id: current_user.id)
   favorite.destroy