app/controllers/users_controller.rb

SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
SELECT "favorites".* FROM "favorites" WHERE "favorites"."user_id" = ?  [["user_id", "1"]]
---
  def show
    @user = User.find(params[:id])
    @user_favorites = @user.favorites.all